---
title: PipePlumbingFixtureFlowData
classe: Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# PipePlumbingFixtureFlowData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double DimensionFlow { get; }` | `pipePlumbingFixtureFlowData.DimensionFlow` | Double |
| `Double FixtureUnits { get; }` | `pipePlumbingFixtureFlowData.FixtureUnits` | Double |
| `Double Flow { get; set; }` | `pipePlumbingFixtureFlowData.Flow` | Double |
| `PipeFlowConfigurationType FlowConfiguration { get; }` | `pipePlumbingFixtureFlowData.FlowConfiguration` | PipeFlowConfigurationType |
| `FlowConversionMode FlowConversionMode { get; }` | `pipePlumbingFixtureFlowData.FlowConversionMode` | FlowConversionMode |
| `Boolean IsValidObject { get; }` | `pipePlumbingFixtureFlowData.IsValidObject` | Boolean |
| `Void Dispose()` | `pipePlumbingFixtureFlowData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```